//Домашнее задание №1
//Задача 1: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

/*Console.Write("Введите 1-е число: ");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите 2-е число: ");
int num2 = Convert.ToInt32(Console.ReadLine());

    if (num1>num2)
    {
    Console.Write(num1 + " больше " + num2 + " невероятно!");
    }
    else
    {
    Console.Write(num2 + " больше " + num1 + " потрясающе!");
    }
*/



//Задача 2: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел

/*Console.WriteLine ("Введите 3 числа: ");

int num1 = Convert.ToInt32(Console.ReadLine());
int num2 = Convert.ToInt32(Console.ReadLine());
int num3 = Convert.ToInt32(Console.ReadLine());

int max = num1;


if (num2 > num1)
max = num2;

if (num3 > num2)
max = num3;

Console.WriteLine("Маскимальное число " + max);
*/


//Задача 3:  Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка)

/*Console.Write("Введите число: ");
int num = Convert.ToInt32(Console.ReadLine());

if (num%2==0)
Console.WriteLine ("поздравляю, у тебя четное число!");
else 
Console.WriteLine ("не повезло, у тебя нечетное, попробуй еще разок;)");
*/



//Задача 4: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N

/*Console.Write("Введите целое число: ");
int num = Convert.ToInt32(Console.ReadLine());
int cur = 1;
while(cur <= num)
{
    Console.Write(cur + " ");
    cur++;
}*/


